Revit 2027 API
BuiltInFailures.ArrayFailures.ArrayingNotSupportedForElements Property
 Arraying is not currently supported for the selected elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ArrayingNotSupportedForElements { get; }
Public Shared ReadOnly Property ArrayingNotSupportedForElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ArrayingNotSupportedForElements {
	FailureDefinitionId^ get ();
}
static member ArrayingNotSupportedForElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace